const catalog = {
    'minimalism-3': {
        title: '1069Ц',
        price: {
            standart: {
                price: '292 434 р',
                equipment: [
                    ['Размер, м', '2,5*1,8*1,8'],
                    ['Высота кухни, мм', '2725'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Базовая'],
                    ['Фасады', 'Термопламинат'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Метабокс Boyard без доводчиков'],
                    ['Столешница', 'Слон'],
                    ['Бутылочница', 'Boyard'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '495 184 р',
                equipment: [
                    ['Размер, м', '2,5*1,8*1,8'],
                    ['Высота кухни, мм', '2725'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Итальянские'],
                    ['Фасады', 'Термопламинат'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Метабокс Boyard с доводчиками'],
                    ['Столешница', 'Искусственный камень'],
                    ['Бутылочница', 'Италия с доводчиком'],
                    ['Лоток для приборов', 'вкладыш'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
            premium: {
                price: '576 286 р',
                equipment: [
                    ['Размер, м', '2,5*1,8*1,8'],
                    ['Высота кухни, мм', '2725'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Итальянские'],
                    ['Фасады', 'Эмаль'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Siena премиум'],
                    ['Наполнение', 'Метабокс Boyard с доводчиками'],
                    ['Столешница', 'Искусственный камень'],
                    ['Бутылочница', 'Италия с доводчиком'],
                    ['Лоток для приборов', 'встроенный'],
                    ['Цоколь', 'МДФ в цвет фасада'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/1069Ц/DSC03368.jpg',
                './assets/img/catalog/1069Ц/DSC03374.jpg',
                './assets/img/catalog/1069Ц/DSC03394.jpg',
                './assets/img/catalog/1069Ц/DSC03397.jpg',
                './assets/img/catalog/1069Ц/DSC03404.jpg',
                './assets/img/catalog/1069Ц/DSC03417.jpg',
                './assets/img/catalog/1069Ц/DSC03418.jpg',
            ],
    },
    'minimalism-2':{
        title: '433М',
        price: {
            standart: {
                price: '212 269 р',
                equipment: [
                    ['Размер, м', '2,98*2,24'],
                    ['Высота верхних модулей, мм', '1260'],
                    ['Покрытие', 'Термоламинат, ЛДСП'],
                    ['Основа', 'МДФ, ЛДСП'],
                    ['Фрезеровка', 'Люкс'],
                    ['Сушка', 'Без'],
                    ['Столешница', 'Слон'],
                    ['Витрина', 'Тонированное стекло "Бронза"'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'Базовые'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '334 434 р',
                equipment: [
                    ['Размер, м', '2,98*2,24'],
                    ['Высота верхних модулей, мм', '1260'],
                    ['Покрытие', 'Термоламинат, ЛДСП'],
                    ['Основа', 'МДФ, ЛДСП'],
                    ['Фрезеровка', 'Люкс'],
                    ['Сушка', 'Siena премиум'],
                    ['Столешница', 'Egger'],
                    ['Витрина', 'Тонированное стекло "Бронза"'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ПВХ'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'Профильные'],
                    ['Фурнитура', 'Boyard с доводчиками Blum'],
                ],
            },
            premium: {
                price: '389 184 р',
                equipment: [
                    ['Размер, м', '2,98*2,24'],
                    ['Высота верхних модулей, мм', '1260'],
                    ['Покрытие', 'Эмаль, ЛДСП'],
                    ['Основа', 'МДФ, ЛДСП'],
                    ['Фрезеровка', 'Люкс'],
                    ['Сушка', 'Siena премиум'],
                    ['Столешница', 'Egger'],
                    ['Витрина', 'Шелби'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ПВХ'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'Профильные'],
                    ['Фурнитура', 'Blum'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/433М/DSC04896.jpg',
                './assets/img/catalog/433М/DSC04910.jpg',
                './assets/img/catalog/433М/DSC04911.jpg',
                './assets/img/catalog/433М/DSC04932.jpg',
                './assets/img/catalog/433М/DSC04933.jpg',
                './assets/img/catalog/433М/DSC04940.jpg',
                './assets/img/catalog/433М/DSC04941.jpg',
                './assets/img/catalog/433М/DSC04942.jpg',
                './assets/img/catalog/433М/DSC04946.jpg',
                './assets/img/catalog/433М/DSC04947.jpg',
                './assets/img/catalog/433М/DSC04948.jpg',
            ],
    },
    'minimalism-1': {
        title: '034Р',
        price: {            
            standart: {
                price: '286 890 р',
                equipment: [
                    ['Размер, м', '3,85*2,55'],
                    ['Высота кухни, мм', '2545'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Наполнение', 'Подсветка светодиодная'],
                    ['Ручки', 'Рейлинг'],
                    ['Фасады', 'Термопламинат'],
                    ['Стекло', 'Базовое'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'нет'],
                    ['Плинтус', 'Базовый'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '495 669 р',
                equipment: [
                    ['Размер, м', '3,85*2,55'],
                    ['Высота кухни, мм', '2545'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Наполнение', 'Подсветка светодиодная'],
                    ['Ручки', 'Профильные Blum'],
                    ['Фасады', 'Термопламинат'],
                    ['Стекло', 'Салават серый'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Siena premium'],
                    ['Столешница', 'Egger'],
                    ['Лоток для приборов', 'Вкладыш'],
                    ['Плинтус', 'Egger'],
                    ['Цоколь', 'ПВХ 150мм'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
            premium: {
                price: '576 793 р',
                equipment: [
                    ['Размер, м', '3,85*2,55'],
                    ['Высота кухни, мм', '2545'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Наполнение', 'Подсветка светодиодная'],
                    ['Ручки', 'Профильные Blum'],
                    ['Фасады', 'Пластик HPL'],
                    ['Стекло', 'Салават серый'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Siena premium'],
                    ['Столешница', 'Egger'],
                    ['Лоток для приборов', 'Встроенный'],
                    ['Плинтус', 'Egger'],
                    ['Цоколь', 'ПВХ 150мм'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/034Р/DSC02084.jpg',
                './assets/img/catalog/034Р/DSC02092.jpg',
                './assets/img/catalog/034Р/DSC02096.jpg',
                './assets/img/catalog/034Р/DSC02098.jpg',
                './assets/img/catalog/034Р/DSC02100.jpg',
                './assets/img/catalog/034Р/DSC02116.jpg',
                './assets/img/catalog/034Р/DSC02135.jpg',
            ],
    },
    'classic-1': {
        title: '028Р',
        price: {
            standart: {
                price: '210 356 р',
                equipment: [
                    ['Размер, м', '2,5*2,5'],
                    ['Высота верхних модулей, мм', '1080'],
                    ['Покрытие', 'Экомембрана с патиной'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Патина'],
                    ['Фрезеровка', 'Ника'],
                    ['Сушка', 'Без'],
                    ['Столешница', 'Слон'],
                    ['Витрина', 'Тонированное стекло "Бронза"'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Радиусный фасад', 'ЛДСП'],
                    ['Ручки', 'Базовые'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '273 548 р',
                equipment: [
                    ['Размер, м', '2,5*2,5'],
                    ['Высота верхних модулей, мм', '1080'],
                    ['Покрытие', 'Экомембрана с патиной'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Патина'],
                    ['Фрезеровка', 'Ника с косичкой'],
                    ['Сушка', 'Хромированная'],
                    ['Столешница', 'Слон'],
                    ['Витрина', 'Пескоструйная обработка'],
                    ['Лоток для приборов', 'Вкладыш'],
                    ['Цоколь', 'ПВХ'],
                    ['Радиусный фасад', 'ЛДСП'],
                    ['Ручки', 'С керамикой'],
                    ['Фурнитура', 'Boyard с доводчиками'],
                ],
            },
            premium: {
                price: '348 562 р',
                equipment: [
                    ['Размер, м', '2,5*2,5'],
                    ['Высота верхних модулей, мм', '1080'],
                    ['Покрытие', 'Экомембрана с патиной'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Патина'],
                    ['Фрезеровка', 'Ника с косичкой'],
                    ['Сушка', 'Siena премиум'],
                    ['Столешница', 'Egger'],
                    ['Витрина', 'Пескоструйная обработка'],
                    ['Лоток для приборов', 'Встроенный'],
                    ['Цоколь', 'МДФ/экомембрана/патина'],
                    ['Радиусный фасад', 'Да'],
                    ['Ручки', 'Итальянские'],
                    ['Фурнитура', 'Blum'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/028Р/DSC03635.jpg',
                './assets/img/catalog/028Р/DSC03636.jpg',
                './assets/img/catalog/028Р/DSC03649.jpg',
                './assets/img/catalog/028Р/DSC03657.jpg',
                './assets/img/catalog/028Р/028Р.jpg',
            ],
    },
    'classic-2':{
        title: '35М',
        price: {
            standart: {
                price: '236 062 р',
                equipment: [
                    ['Размер, м', '3,5*3,1'],
                    ['Высота верхних модулей, мм', '900'],
                    ['Покрытие', 'Экомембрана с патиной'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Патина'],
                    ['Фрезеровка', 'Ника'],
                    ['Сушка', 'Без'],
                    ['Столешница', 'Слон'],
                    ['Витрина', 'Тонированное стекло "Бронза"'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Ручки', 'Базовые'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '284 878 р',
                equipment: [
                    ['Размер, м', '3,5*3,1'],
                    ['Высота верхних модулей, мм', '900'],
                    ['Покрытие', 'Экомембрана с патиной'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Патина'],
                    ['Фрезеровка', 'Ника'],
                    ['Сушка', 'Хромированная'],
                    ['Столешница', 'Эггер'],
                    ['Витрина', 'Пескоструйная обработка'],
                    ['Лоток для приборов', 'Вкладыш'],
                    ['Цоколь', 'ПВХ'],
                    ['Ручки', 'Винтаж'],
                    ['Фурнитура', 'Boyard с доводчиками'],
                ],
            },
            premium: {
                price: '426 326 р',
                equipment: [
                    ['Размер, м', '3,5*3,1'],
                    ['Высота верхних модулей, мм', '900'],
                    ['Покрытие', 'Экомембрана с патиной'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Патина'],
                    ['Фрезеровка', 'Ника'],
                    ['Сушка', 'Siena премиум'],
                    ['Столешница', 'Эггер'],
                    ['Витрина', 'Пескоструйная обработка'],
                    ['Лоток для приборов', 'Встроенный'],
                    ['Цоколь', 'МДФ/эмаль'],
                    ['Ручки', 'Итальянские'],
                    ['Фурнитура', 'Blum'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/35М/1.jpeg',
                './assets/img/catalog/35М/2.jpeg',
                './assets/img/catalog/35М/3.jpeg',
                './assets/img/catalog/35М/4.jpeg',
                './assets/img/catalog/35М/5.jpeg',
                './assets/img/catalog/35М/6.jpeg',
                './assets/img/catalog/35М/7.jpeg',
                './assets/img/catalog/35М/8.jpeg',
            ],
    },
    'classic-3':{
        title: '84М',
        price: {
            standart: {
                price: '306 269 р',
                equipment: [
                    ['Размер, м', '3,52*2,68'],
                    ['Высота верхних модулей, мм', '1080'],
                    ['Покрытие', 'Эмаль'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Золото'],
                    ['Фрезеровка', 'Кардинал'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Без'],
                    ['Столешница', 'Слон'],
                    ['Бутылочница', 'Нет'],
                    ['Витрина', 'Стекло прозрачное с крестообразной накладкой'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'Базовые'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '430 568 р',
                equipment: [
                    ['Размер, м', '3,52*2,68'],
                    ['Высота верхних модулей, мм', '1080'],
                    ['Покрытие', 'Эмаль'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Золото'],
                    ['Фрезеровка', 'Кардинал'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'В нижнюю базу пр-во Италия'],
                    ['Столешница', 'Слон'],
                    ['Бутылочница', 'С доводчиком пр-во Италия'],
                    ['Витрина', 'Стекло прозрачное с крестообразной накладкой'],
                    ['Лоток для приборов', 'Вкладной'],
                    ['Цоколь', 'МДФ/эмаль'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'пр-во Италия'],
                    ['Фурнитура', 'Boyard с доводчиками, Blum'],
                ],
            },
            premium: {
                price: '468 243 р',
                equipment: [
                    ['Размер, м', '3,52*2,68'],
                    ['Высота верхних модулей, мм', '1080'],
                    ['Покрытие', 'Эмаль'],
                    ['Основа', 'МДФ'],
                    ['Патинирование', 'Золото'],
                    ['Фрезеровка', 'Кардинал'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'В нижнюю базу пр-во Италия'],
                    ['Столешница', 'Egger'],
                    ['Бутылочница', 'С доводчиком пр-во Италия'],
                    ['Витрина', 'Стекло Стопсол классик КЛЕР с крестообразной накладкой'],
                    ['Лоток для приборов', 'Вкладной'],
                    ['Цоколь', 'МДФ/эмаль'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'пр-во Италия'],
                    ['Фурнитура', 'Blum'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
                './assets/img/catalog/84М/DSC04691.jpg',
            ],
    },

    //neoclassic

    'neoclassic-1': {
        title: '68M',
        price: {
            standart: {
                price: '273 852 р',
                equipment: [
                    ['Размер, м', '2,57*3,95'],
                    ['Покрытие', 'Эмаль'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс, Лайн'],
                    ['Сушка', 'Без'],
                    ['Столешница', 'Слон'],
                    ['Бутылочница', 'Нет'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'Базовые'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '319 849 р',
                equipment: [
                    ['Размер, м', '2,57*3,95'],
                    ['Покрытие', 'Эмаль'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс, Лайн'],
                    ['Сушка', 'В нижнюю базу BOYARD'],
                    ['Столешница', 'Egger'],
                    ['Бутылочница', 'С доводчиком пр-во Италия'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ПВХ'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'Рейлинги'],
                    ['Фурнитура', 'Boyard с доводчиками, Blum'],
                ],
            },
            premium: {
                price: '395 875 р',
                equipment: [
                    ['Размер, м', '2,57*3,95'],
                    ['Покрытие', 'Эмаль'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс, Лайн'],
                    ['Сушка', 'В нижнюю базу пр-во Италия'],
                    ['Столешница', 'Egger'],
                    ['Бутылочница', 'С доводчиком пр-во Италия'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'МДФ/Эмаль'],
                    ['Радиусный фасад', 'нет'],
                    ['Ручки', 'Профильные, ручки скобы пр-во Италия'],
                    ['Фурнитура', 'Blum'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/68М/1.jpeg',
                './assets/img/catalog/68М/DSC04191.jpg',
                './assets/img/catalog/68М/DSC04205.jpg',
                './assets/img/catalog/68М/DSC04213.jpg',
                './assets/img/catalog/68М/DSC04224.jpg',
                './assets/img/catalog/68М/DSC04226.jpg',
                './assets/img/catalog/68М/DSC04228.jpg',
                './assets/img/catalog/68М/DSC04229.jpg',
                './assets/img/catalog/68М/DSC04235.jpg',
                './assets/img/catalog/68М/DSC04244.jpg',
            ],
    },
    'neoclassic-2':{
        title: '384М',
        price: {
            standart: {
                price: '285 200 р',
                equipment: [
                    ['Размер, м', '3,585'],
                    ['Высота кухни, мм', '2590'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Прованс Пюр'],
                    ['Ручки', 'Макмарт'],
                    ['Фасады', 'Эмаль'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Метабокс Boyard без доводчиков'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'нет'],
                    ['Стеновая панель', 'Слон'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '458 050 р',
                equipment: [
                    ['Размер, м', '3,585'],
                    ['Высота кухни, мм', '2590'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Прованс Пюр'],
                    ['Ручки', 'Макмарт'],
                    ['Фасады', 'Эмаль'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Метабокс Boyard с доводчиками'],
                    ['Столешница', 'Egger'],
                    ['Лоток для приборов', 'Вкладыш'],
                    ['Стеновая панель', 'Egger'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            premium: {
                price: '593 049 р',
                equipment: [
                    ['Размер, м', '3,585'],
                    ['Высота кухни, мм', '2590'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Прованс Пюр'],
                    ['Ручки', 'Макмарт'],
                    ['Фасады', 'Эмаль'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Хромированная премиум'],
                    ['Наполнение', 'Тандембокс Blum с доводчиками с внутренними ящиками'],
                    ['Столешница', 'Искусственный камень'],
                    ['Лоток для приборов', 'Встроенный'],
                    ['Стеновая панель', 'Искусственный камень'],
                    ['Цоколь', 'ПВХ с металлизированным покрытием "золото шлифованное"'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/384М/1.jpg',
                './assets/img/catalog/384М/3.jpg',
                './assets/img/catalog/384М/5.jpg',
                './assets/img/catalog/384М/6.jpg',
            ],
    },
    'neoclassic-3':{
        title: '434М',
        price: {
            standart: {
                price: '287 801 р',
                equipment: [
                    ['Размер, м', '3,38*1,8'],
                    ['Высота верхних модулей, мм', '1260'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Итальянские'],
                    ['Фрезеровка', 'Люкс, Лайн'],
                    ['Фасады', '3D Термоламинат'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Метабокс Boyard без доводчиков'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                    ['Витрина', 'Стекло "Бронза"'],
                ],
            },
            comfort: {
                price: '412 818 р',
                equipment: [
                    ['Размер, м', '3,38*1,8'],
                    ['Высота верхних модулей, мм', '1260'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Итальянские врезные'],
                    ['Фрезеровка', 'Лайн, Тонкая рамка'],
                    ['Фасады', 'Эмаль'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Тандембокс Boyard с доводчиками'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'вкладыш'],
                    ['Цоколь', 'ПВХ'],
                    ['Фурнитура', 'Boyard с дводчиками'],
                    ['Витрина', 'Стекло "Шэбби"'],
                ],
            },
            premium: {
                price: '610 189 р',
                equipment: [
                    ['Размер, м', '3,38*1,8'],
                    ['Высота верхних модулей, мм', '1260'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Итальянские врезные'],
                    ['Фрезеровка', 'Лайн, Тонкая рамка'],
                    ['Фасады', 'Эмаль'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Хромированная премиум'],
                    ['Наполнение', 'Тандембокс Blum с доводчиками'],
                    ['Столешница', 'Искусственный камень'],
                    ['Лоток для приборов', 'встроенный'],
                    ['Цоколь', 'ПВХ'],
                    ['Фурнитура', 'Blum с дводчиками'],
                    ['Витрина', 'Стекло "Шэбби"'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/434М/DSC03668.jpg',
                './assets/img/catalog/434М/DSC03676.jpg',
                './assets/img/catalog/434М/DSC03677.jpg',
                './assets/img/catalog/434М/DSC03681.jpg',
                './assets/img/catalog/434М/DSC03726.jpg',
                './assets/img/catalog/434М/DSC03728.jpg',
                './assets/img/catalog/434М/DSC03746.jpg',
                './assets/img/catalog/434М/DSC03750.jpg',
                './assets/img/catalog/434М/DSC03755.jpg',
            ],
    },

    //loft

    'loft-1': {
        title: '1058Ц',
        price: {
            standart: {
                price: '157 458 р',
                equipment: [
                    ['Размер, м', '2,5*1,8'],
                    ['Высота верхних модулей, мм', '900'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Профильная'],
                    ['Покрытие', 'Термоламинат'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Без'],
                    ['Наполнение', 'Метабокс Боярд без доводчиков'],
                    ['Столешница', 'Слон'],
                    ['Витрина', 'Стекло'],
                    ['Стеновая панель', 'Слон'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '267 000 р',
                equipment: [
                    ['Размер, м', '2,5*1,8'],
                    ['Высота верхних модулей, мм', '900'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Профильная'],
                    ['Покрытие', 'Термоламинат'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Тандембокс Blum с доводчиками'],
                    ['Столешница', 'Egger'],
                    ['Витрина', 'Стекло Металюкс'],
                    ['Стеновая панель', 'Egger'],
                    ['Лоток для приборов', 'вкладыш'],
                    ['Цоколь', 'ПВХ'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
            premium: {
                price: '324 889 р',
                equipment: [
                    ['Размер, м', '2,5*1,8'],
                    ['Высота верхних модулей, мм', '900'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Профильная'],
                    ['Покрытие', 'Эмаль матовая'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Siena премиум'],
                    ['Наполнение', 'Тандембокс Blum с доводчиками'],
                    ['Столешница', 'Egger'],
                    ['Витрина', 'Стекло Металюкс'],
                    ['Стеновая панель', 'Egger'],
                    ['Лоток для приборов', 'встроенный'],
                    ['Цоколь', 'МДФ в цвет фасада'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/1058Ц/5CDD19E3-60F7-417A-A3F4-49ACB0A52E91.jpeg',
                './assets/img/catalog/1058Ц/7B923A73-3F03-4F70-BC29-E7A211EE4BAC.jpeg',
                './assets/img/catalog/1058Ц/9E46CC54-BDC2-4BEF-9F06-E4097E8D5C5F.jpeg',
                './assets/img/catalog/1058Ц/38B3CA1F-3C26-4429-A30F-F4A38E38EB55.jpeg',
                './assets/img/catalog/1058Ц/539032C7-052B-4727-A306-D0D9CD6D0BC1.jpeg',
                './assets/img/catalog/1058Ц/ABDBE222-4EC6-43A9-B129-AF638617B49A.jpeg',
                './assets/img/catalog/1058Ц/B3DAF279-DDF9-415E-A055-0D6D8D7C19C5.jpeg',
                './assets/img/catalog/1058Ц/B6CFED67-CE5E-4921-8B02-D3337B57C50F.jpeg',
                './assets/img/catalog/1058Ц/C439D775-38EA-4630-8FC4-5C004F8766C9.jpeg',
                './assets/img/catalog/1058Ц/EA497B04-2AE6-4D80-A35A-11ECFB06E274.jpeg',
            ],
    },
    'loft-2':{
        title: 'Сомов',
        price: {
            standart: {
                price: '209 914 р',
                equipment: [
                    ['Размер, м', '4,85*2,1'],
                    ['Высота кухни, мм', '2600'],
                    ['Основа', 'ЛДСП'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Скоба'],
                    ['Фасады', 'ЛДСП Egger'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Без'],
                    ['Наполнение', 'Метабокс Боярд без доводчиков'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                ],
            },
            comfort: {
                price: '312 958 р',
                equipment: [
                    ['Размер, м', '4,85*2,1'],
                    ['Высота кухни, мм', '2600'],
                    ['Основа', 'МДФ'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Профильные накладные'],
                    ['Фасады', 'Плита IDM'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'в нижнюю базу пр-во Италия'],
                    ['Наполнение', 'Тандембокс Blum с доводчикамим'],
                    ['Столешница', 'Egger'],
                    ['Лоток для приборов', 'вкладыш'],
                    ['Цоколь', 'из материала фасада'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
            premium: {
                price: '363 862 р',
                equipment: [
                    ['Размер, м', '4,85*2,1'],
                    ['Высота кухни, мм', '2600'],
                    ['Основа', 'нанокомпозит'],
                    ['Фрезеровка', 'Люкс'],
                    ['Ручки', 'Профильные накладные'],
                    ['Фасады', 'Пластик HPL'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'в нижнюю базу пр-во Италия'],
                    ['Наполнение', 'Тандембокс Blum с доводчикамим'],
                    ['Столешница', 'Egger'],
                    ['Лоток для приборов', 'вкладыш'],
                    ['Цоколь', 'из материала фасада'],
                    ['Фурнитура', 'Blum с доводчиками'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/Сомов/2E344A18-9166-4623-B8EF-191C7AB4BF91.jpg',
                './assets/img/catalog/Сомов/3D5428AF-17C2-4A2B-99DD-6C43BDB00018.jpg',
                './assets/img/catalog/Сомов/933E0064-6EFB-4488-BAFA-C4BE1819EC79.jpg',
                './assets/img/catalog/Сомов/4521522C-BB00-4C28-BD7F-A5C5F756FFAC.jpg',
                './assets/img/catalog/Сомов/A7BB04BF-A3AA-4850-BB5E-27D548FD391B.jpg',
                './assets/img/catalog/Сомов/F63BACED-1F74-42E3-A02E-C34CA552875D.jpg',
                './assets/img/catalog/Сомов/F5918A11-1CFB-4DF9-800A-68D16FF0EC37.jpg',

            ],
    },

    //provance

    'provance-1':{
        title: '55М',
        price: {
            standart: {
                price: '247 456 р',
                equipment: [
                    ['Размер, м', '3,85*2,55'],
                    ['Высота кухни, мм', '2545'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Рейлинг'],
                    ['Фрезеровка', 'Ника'],
                    ['Фасады', 'Экомембрана'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                    ['Витрина', 'Стекло стандарт'],
                    ['Еврозапил', 'нет'],
                    ['Плинтус', 'Термопласт'],
                ],
            },
            comfort: {
                price: '327 009 р',
                equipment: [
                    ['Размер, м', '3,85*2,55'],
                    ['Высота кухни, мм', '2545'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Cкобы, Италия'],
                    ['Фрезеровка', 'Прованс, Прованс пюр'],
                    ['Фасады', 'Эмаль матовая'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'Вкладыш'],
                    ['Цоколь', 'МДФ эмаль в цвет фасадов'],
                    ['Фурнитура', 'Boyard с доводчиками'],
                    ['Витрина', 'Стекло Салават'],
                    ['Еврозапил', 'нет'],
                    ['Плинтус', 'Термопласт'],
                ],
            },
            premium: {
                price: '423 946 р',
                equipment: [
                    ['Размер, м', '3,85*2,55'],
                    ['Высота кухни, мм', '2545'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Cкобы, Италия'],
                    ['Фрезеровка', 'Прованс, Прованс пюр'],
                    ['Фасады', 'Эмаль матовая'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Хромированная премиум'],
                    ['Столешница', 'Egger'],
                    ['Лоток для приборов', 'Встроенный'],
                    ['Цоколь', 'МДФ эмаль в цвет фасадов'],
                    ['Фурнитура', 'Blum с доводчиками'],
                    ['Витрина', 'Стекло Салават'],
                    ['Еврозапил', 'да'],
                    ['Плинтус', 'Эггер'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/55М/1.jpeg',
                './assets/img/catalog/55М/2.jpeg',
                './assets/img/catalog/55М/3.jpeg',
                './assets/img/catalog/55М/4.jpeg',
                './assets/img/catalog/55М/5.jpeg',
                './assets/img/catalog/55М/6.jpeg',
                './assets/img/catalog/55М/7.jpeg',
            ],
    },
    'provance-2':{
        title: 'C227',
        price: {
            standart: {
                price: '161 546 р',
                equipment: [
                    ['Размер, м', '2,25*2,5'],
                    ['Высота кухни, мм', '2315'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Скоба, Италия'],
                    ['Фрезеровка', 'Люкс, Ника'],
                    ['Фасады', 'Экомембрана'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Метабокс Boyard с доводчиками'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'нет'],
                    ['Цоколь', 'ЛДСП'],
                    ['Фурнитура', 'Boyard без доводчиков'],
                    ['Пристеночный плинтус', 'Термопласт'],
                    ['Витрина', 'Стекло стандарт'],
                ],
            },
            comfort: {
                price: '221 857 р',
                equipment: [
                    ['Размер, м', '2,25*2,5'],
                    ['Высота кухни, мм', '2315'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Скоба, Италия'],
                    ['Фрезеровка', 'Люкс, Прованс Пюр'],
                    ['Фасады', 'Эмаль матовая'],
                    ['Корпус', 'ЛДСП Lamarty'],
                    ['Сушка', 'Хромированная'],
                    ['Наполнение', 'Тандембокс Boyard с доводчиками'],
                    ['Столешница', 'Слон'],
                    ['Лоток для приборов', 'вкладыш'],
                    ['Цоколь', 'ПВХ'],
                    ['Фурнитура', 'Boyard с доводчиками'],
                    ['Пристеночный плинтус', 'Термопласт'],
                    ['Витрина', 'Стекло Салават'],
                ],
            },
            premium: {
                price: '315 094 р',
                equipment: [
                    ['Размер, м', '2,25*2,5'],
                    ['Высота кухни, мм', '2315'],
                    ['Основа', 'МДФ'],
                    ['Ручки', 'Скоба, Италия'],
                    ['Фрезеровка', 'Люкс, Прованс Пюр'],
                    ['Фасады', 'Эмаль матовая'],
                    ['Корпус', 'ЛДСП Egger'],
                    ['Сушка', 'Хромированная премиум'],
                    ['Наполнение', 'Тандембокс Blum с доводчиками'],
                    ['Столешница', 'Эггер + Пластик HPL'],
                    ['Лоток для приборов', 'Встроенный'],
                    ['Цоколь', 'МДФ в цвет фасадов'],
                    ['Фурнитура', 'Blum с доводчиками'],
                    ['Пристеночный плинтус', 'Эггер'],
                    ['Витрина', 'Стекло Салават'],
                ],
            },
        },
        src:
            [
                './assets/img/catalog/С227/1.jpeg',
                './assets/img/catalog/С227/2.jpeg',
                './assets/img/catalog/С227/3.jpeg',
                './assets/img/catalog/С227/4.jpeg',
                './assets/img/catalog/С227/5.jpeg',
                './assets/img/catalog/С227/6.jpeg',
            ],
    },
};

jQuery(document).ready(function () {
    let step = 1;
    $("#menu-item").on("click",function (){
       $(".menu").toggle("slow");
    });
    $(".menu li").on("click",function (){
        $(".menu").toggle("slow");
     });
    $(".cookie-btn").on("click", function (){
        $(".cookie").hide();
    });
    $(".psevdo-before").on("click",function (){
        if($(".fixed-block").data("open") == "close") {
            $(".fixed-block").css("right", 0);
            $(".fixed-block").data("open","open");
            $(".fixed-block").toggleClass("close-block");
            $(".fixed-block").toggleClass("open-block");
        } else {
            $(".fixed-block").css("right", `${$(document).width() < 768 ? '-230px' : '-140px'}`);
            $(".fixed-block").data("open","close");
            $(".fixed-block").toggleClass("close-block");
            $(".fixed-block").toggleClass("open-block");
        }
    });
    $("#quiz-open, #quiz-open-2").on("click",function (){
        $("#quiz-"+step).hide();
        $("#quiz-"+(step)).css('display', 'flex');
        $(".modal").css("display","flex");
        $(".Quiz").toggle();
        $(".overlay").toggle();
        if($(".Quiz").data("open") == "close") {
            $(".Quiz").attr("data-open","open");
            $("body").css("overflow","hidden");
        }else{
            $(".Quiz").attr("data-open","close");
            $("body").css("overflow","none");
        }
    })
    // $(".quiz-open").on("click",function (){
    //     $(".modal").toggle("flex");
    //     $(".Quiz").toggle();
    //     $(".overlay").toggle();
    //     if($(".Quiz").data("open") == "close") {
    //         $(".Quiz").attr("data-open","open");
    //         $("body").css("overflow","hidden");
    //     }else{
    //         $(".Quiz").attr("data-open","close");
    //         $("body").css("overflow","none");
    //     }
    // })

    $(".open-modal").on("click",function (){
        $(".modal").css("display","flex");
        $(".modal-form").toggle();
        $(".overlay").toggle();
    })

    $(".open-modal-design").on("click",function (){
        $(".modal").css("display","flex");
        $(".modal-design").toggle();
        $(".overlay").toggle();
    });

	setTimeout(() => {
		$("#modal-3").click();
	}, 30000);

	class Timer {
		constructor(callback, delay) {
		  this.callback = callback
		  this.remainingTime = delay
		  this.startTime
		  this.timerId
		}

		clear() {
			clearTimeout(this.timerId);
		};
	  
		pause() {
		  clearTimeout(this.timerId)
		  this.remainingTime -= new Date() - this.startTime
		}
	  
		resume() {
		  this.startTime = new Date()
		  clearTimeout(this.timerId)
		  this.timerId = setTimeout(this.callback, this.remainingTime)
		}
	  
		start() {
		  this.timerId = setTimeout(this.callback, this.remainingTime)
		}
	  }

	const timeoutOpenModalStock = new Timer(function() {
		$("#modal-3").click();
	}, 120000);	

	let allInput = $(':input');
	allInput.map(() => {
		this.addEventListener('focus', () => timeoutOpenModalStock.pause());
		this.addEventListener('blur', () => timeoutOpenModalStock.resume());
	});

    $("#modal-1,#modal-2,#modal-3,#modal-4").on("click",function (){
        $(".menu-modal").css("display","flex");
       let name = $(this).attr("id");
       $("."+name).css("display","flex");
       $(".modal").css("display","block");
       $(".overlay").toggle();

       $("#"+name+"-item").addClass('active');
        if (name == 'modal-3') {
            if ( $(".modal-3 .draggable").height() == 0) {
                if ($(document).width() > 1440) {
                    $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 40);
                }
                if ($(document).width() > 992 && $(document).width() < 1440) {
                    $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 40 - 0.5*(1500 - $(document).width()));
                }
                if ($(document).width() < 992 && $(document).width() > 768) {
                    $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 240);
                }
                if ($(document).width() < 768 && $(document).width() > 600) {
                    $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 340);
                }
                if ($(document).width() < 600 && $(document).width() > 500) {
                    $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 280);
                }
                if ($(document).width() < 500) {
                    $(".modal-3 .draggable").css('height', "560px");
                }
                $(".slide-cont").removeAttr('style');
            }
            if ($(".action-slider .slick-track").width() == 0) {
                $(".action-slider .slick-track").css("width", "");
            }
        }
    });

    $(".open-modal-slider").on("click",function (){
        $(".modal-slider").css("display","flex");
        $(".modal").css("display","flex");
        if ( $(".modal-slider .draggable").height() == 0) {
            $(".modal-slider .draggable").css("height", '400');
            $(".modal-slider .slick-slide").css("width", '');
            $(".modal-slider .slick-track").css("width", '');
        }
    });

    $(".open-slider-design").on("click",function (){
        $(".modal-slider-design").css("display","flex");
        $(".modal").css("display","flex");
        if ( $(".modal-slider-design .draggable").height() == 0) {
            $(".modal-slider-design .draggable").css("height", '400');
            $(".modal-slider-design .slick-slide").css("width", '');
            $(".modal-slider-design .slick-track").css("width", '');
        }
    });

    $(".overlay-modal").on("click",function () {
            $(".modal-info").hide();
            $(".overlay-modal").css('display', 'none');
    });

    $(".overlay-modal-info").on("click", function () {
        $(".modal-info").hide();
        $(".modal").hide();
        $(".overlay-modal-info").css('display', 'none');
    });

    $("#Quiz-cross").on("click",function () {
            $(".Quiz").hide();
            $(".modal").hide();
       		$("#quiz-"+(step)).css('display', 'none');
            $(".Quiz").attr("data-open","close")
            $("body").css("overflow","scroll");
            $(".overlay").css('display', 'none');
    });

    $('.cross').on("click", function (){
        if ($(this).parent().parent().data("info") && $(".Quiz").attr("data-open") == 'open') {
            $(".modal-info").hide();
            $(".overlay").css('display', 'none');
            $(".overlay-modal").css('display', 'none');

        } else {
            $(`section.modal`).hide();
            $(this).parent().parent().hide();
            $(".overlay").css('display', 'none');
            $(".overlay-modal-info").css('display', 'none');
        };
        $(".menu-modal").css('display', 'none');
        $(".menu-modal>div.active").removeClass("active");
		timeoutOpenModalStock.start();
    });

    $(".cross-modal-slider").on("click", function (){
        if ($(".modal-mod-3").css("display") == "flex") {
            $(".modal-slider").hide();
        } else {
            $(`section.modal`).hide();
            $(this).parent().parent().hide();
            $(".overlay").css('display', 'none');
        };
    });

    $(".cross-slider-design").on("click", function (){
        $(".modal-slider-design").hide();
    });

    $(".cross-mod").on("click", function (){
        let number = $(this).parent().parent().attr('data-number')
        $(`section.modal`).hide();
        $(this).parent().parent().hide();
        $(".overlay").css('display', 'none');
        $(".stage-slider-mod-"+number).empty();
        $(".stage-slider-mod-"+number).removeClass("slick-initialized");
        $(".stage-slider-mod-"+number).removeClass("slick-slider");
    });

    $(".cross-mod-2").on("click", function (){
        let number = $(this).parent().parent().attr('data-number')
        $(`section.modal`).hide();
        $(this).parent().parent().hide();
        $(".overlay").css('display', 'none');
        $(".stage-slider-mod-"+number).empty();
        $('.modal-mod-2 .price-table ul').empty();
        $(".stage-slider-mod-"+number).removeClass("slick-initialized");
        $(".stage-slider-mod-"+number).removeClass("slick-slider");
    });

    $(".item-form").on("click",function (){
        if ($(this).find(".active").length !== 0) {
            if($(this).parent().parent().parent().parent().attr("data") == "bl-quiz") {
                $(this).find(".active").removeClass("active");
                $(".quiz-next-section").addClass("quiz-next-desable");
                return
            }
            if($(this).parent().parent().parent().parent().attr("data") == "bl-quiz-modal") {
                $(this).find(".active").removeClass("active");
                $(".quiz-next-modal").addClass("quiz-next-desable");
                return
            }
            $(this).find(".active").removeClass("active");
            $(".quiz-next").addClass("quiz-next-desable");
            $(".quiz-back").addClass("quiz-next-desable");
            return
        }
        $(".quiz-next").removeClass("quiz-next-desable");
        $(".quiz-back").removeClass("quiz-next-desable");
        $(".quiz-next-section").removeClass("quiz-next-desable");
        $(".quiz-next-modal").removeClass("quiz-next-desable");
        let old = $(this).parent().find(".active");
        old.removeClass("active");
        $(this).find(".item-name").addClass("active");
        let img = $(this).find("img").attr("src");
        $(this).parent().parent().find("img.quiz-img").attr("src",img);
    });

    $("#quiz-6 .item-form, #quiz-7 .item-form, #quiz-8 .item-form").on("click",function (){
        let old = $(this).parent().find(".active");
        old.removeClass("active");
        $(this).find(".item-name").addClass("active");
        let img = $(this).find(".img-quiz").attr("src");
        $(this).parent().parent().find("img.quiz-img").attr("src",img);
    });

    $(document).ready(() => {
        $('.slider').slick({
            centerMode: true,
            centerPadding: '60px',
            adaptiveHeight: true,
            slidesToShow: 3,
            autoplay: true,
            autoplaySpeed: 5000,
            prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: -40px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
            nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: -40px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>',
            responsive: [
                {
                    breakpoint: 768,
                    settings: {
                        arrows: false,
                        centerMode: true,
                        centerPadding: '40px',
                        slidesToShow: 3
                    }
                },
                {
                    breakpoint: 480,
                    settings: {
                        arrows: false,
                        centerMode: true,
                        centerPadding: '40px',
                        slidesToShow: 1
                    }
                }
            ]
        });
        $(".review-slider").slick({
            slidesToShow: 1,
            slidesToScroll: 1,
            autoplay: true,
            autoplaySpeed: 10000,
            adaptiveHeight: false,
            prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: 10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
            nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: 10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>'
        });
        $(".stage-slider, .about-us-slider").slick({
            slidesToShow: 1,
            slidesToScroll: 1,
            adaptiveHeight: true,
            autoplay: true,
            autoplaySpeed: 4000,
            prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: 10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
            nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: 10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>'
        });
        $(".background-slider").slick({
            slidesToShow: 1,
            slidesToScroll: 1,
            adaptiveHeight: true,
            autoplay: true,
            autoplaySpeed: 10000,
        });
        $(".message-slider, .design-slider").slick({
            slidesToShow: 1,
            slidesToScroll: 1,
            adaptiveHeight: true,
            autoplay: true,
            autoplaySpeed: 4000,
            prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: -40px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
            nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: -40px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>'
        });
        $(".action-slider").slick({
            slidesToShow: 1,
            slidesToScroll: 1,
            adaptiveHeight: true,
            autoplay: true,
            autoplaySpeed: 4000,
            prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: -10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
            nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: -10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>'
        });
    });

    $("#employee").on("click", function (){
        $("#employee").next().removeClass("d-none");
        $("#employee").hide();
    });
    // $(".examples .catalog-select").on("click",function (){
    //     let name = $(this).attr("data-example");
    //     $(".examples  .catalog-select.active").removeClass("active");
    //     $(".examples  .catalog-select[data-example="+name+"]").addClass("active");
    //     $(".examples  .catalog-active").removeClass("catalog-active");
    //     $("#"+name).addClass("catalog-active");
    //  });

    $(".catalog-kitchen .catalog-select").on("click",function (){
       let name = $(this).attr("data-catalog");
       $(".catalog-kitchen .catalog-select.active").removeClass("active");
       $(".catalog-kitchen .catalog-select[data-catalog="+name+"]").addClass("active");
       $(".catalog-kitchen .catalog-active-k").removeClass("catalog-active-k");
       $("#"+name).addClass("catalog-active-k");
    });
    $(".catalog-select-all").on("click", function (){
        $(this).hide();
        $(".sel-provance").show();
        $(".sel-loft").show();
    });
    $(".thanc-you .price-select").on("click",function (){
        let name = $(this).attr("data-price");
        $(".thanc-you .price-select.active").removeClass("active");
        $(".thanc-you .price-select[data-price="+name+"]").addClass("active");
        $(".thanc-you .price-active").removeClass("price-active");
        $(".thanc-you #"+name).addClass("price-active");
     });
    $(".catalog-kitchen .catalog-item-select").on("click",function (){
        let name = $(this).attr("data-type");
        let firstName = $(this).parent().parent().parent().attr("data-name");
        $(".catalog-kitchen ."+firstName+" .catalog-item-select.active").removeClass("active");
        $(".catalog-kitchen ."+firstName+" .catalog-item-select[data-type="+name+"]").addClass("active");
        $(".catalog-kitchen ."+firstName+" .catalog-item-active").removeClass("catalog-item-active");
        $("."+firstName+" #"+name).addClass("catalog-item-active");
     });
    $(".stage .catalog-select").on("click",function (){
        let name = $(this).attr("data-stage");
        $(".stage .catalog-select.active").removeClass("active");
        $(".stage .catalog-select[data-stage="+name+"]").addClass("active");
        $(".stage .catalog-active").removeClass("catalog-active");
        $("#"+name).addClass("catalog-active");
    });
    $(".restart").on("click", function (){
        $(".stage .catalog-select.active").removeClass("active");
        $(".stage .catalog-select[data-stage=project]").addClass("active");
        $(".stage .catalog-active").removeClass("catalog-active");
        $("#project").addClass("catalog-active");
    });
    if($(document).width() < 992) {
        $(".dop-img[data-stage=goals-1]").addClass("active");
    }
    $(".stage-4-goals>div").on("click",function (){
        let name = $(this).attr("id");
        $(".stage-4-goals>div.active,.stage-4-item.active").removeClass("active");
       $(this).addClass("active");
        $(".stage-4-item[data-stage="+name+"]").addClass("active");
        if($(document).width() < 992) {
            $(".dop-img.active").removeClass("active");
            $(".dop-img[data-stage="+name+"]").addClass("active");
        }
    });
    $("#modal-1-item").on("click",function (){
        let modal = $(".menu-modal>div.active").attr('data-open');
        $(".menu-modal>div.active").removeClass("active");
        $("."+modal).hide();
        $(this).addClass("active");
        $(".modal-1").css("display", "flex");
    });
    $("#modal-2-item").on("click",function (){
        let modal = $(".menu-modal>div.active").attr('data-open');
        $(".menu-modal>div.active").removeClass("active");
        $("."+modal).hide();
        $(this).addClass("active");
        $(".modal-2").css("display", "flex");
    });
    $("#modal-3-item").on("click",function (){
        let modal = $(".menu-modal>div.active").attr('data-open');
        $(".menu-modal>div.active").removeClass("active");
        $("."+modal).hide();
        $(this).addClass("active");
        $(".modal-3").css("display", "block");
        if ( $(".modal-3 .draggable").height() == 0) {
            if ($(document).width() > 1440) {
                $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 40);
            }
            if ($(document).width() > 992 && $(document).width() < 1440) {
                $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 40 - 0.5*(1500 - $(document).width()));
            }
            if ($(document).width() < 992 && $(document).width() > 768) {
                $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 240);
            }
            if ($(document).width() < 768 && $(document).width() > 600) {
                $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 340);
            }
            if ($(document).width() < 600 && $(document).width() > 500) {
                $(".modal-3 .draggable").css('height', $(".slide-cont").height() + 280);
            }
            if ($(document).width() < 500) {
                $(".modal-3 .draggable").css('height', "540px");
            }
            $(".slide-cont").removeAttr('style');
        }
        if ($(".action-slider .slick-track").width() == 0) {
            $(".action-slider .slick-track").css("width", "");
        }
    });
    $("#modal-4-item").on("click",function (){
        let modal = $(".menu-modal>div.active").attr('data-open');
        $(".menu-modal>div.active").removeClass("active");
        $("."+modal).hide();
        $(this).addClass("active");
        $(".modal-4").css("display", "flex");
    });

    $(".type-place").on("click",function (){
        $(".type-place.active ").removeClass("active");
        $(".type-material.d-flex").addClass("d-none");
        $(".type-material.d-flex").removeClass("d-flex");

        $(this).addClass("active");
        let name = $(this).attr("data-material");
        $("#type-material-"+name).removeClass("d-none");
        $("#type-material-"+name).addClass("d-flex");
        $(".type-list.green").removeClass("green");
        $("#type-material-"+name+" div:first-child").addClass("green");

        $(".material").find(".material-list.d-flex").addClass("d-none");
        $(".material").find(".material-list.d-flex").removeClass("d-flex");
        $(`#material-list-${name == 1 ? 1 : (name == 2 ? 6 : 8)}`).addClass("d-flex");
        $(`#material-list-${name == 1 ? 1 : (name == 2 ? 6 : 8)}`).removeClass("d-none");
    });
    $(".type-list").on("click",function (){
       let num = $(this).attr("data-material");
       $(".type-list.green").removeClass("green");
        $(".material-list.d-flex").addClass("d-none");
        $(".material-list.d-flex").removeClass("d-flex");


        $(this).addClass("green");
        $("#material-list-"+num).removeClass("d-none");
        $("#material-list-"+num).addClass("d-flex");
    });

    for (let i = 1; i <= 6; i++) {
        $(`#btn-info-${i}`).on("click", function () {
            let text = $(this).next().html();
            let width = $(this).next().attr("data-width");
            $("#info-input").html();
            $("#info-input").html(text);
            $(".modal").css("display","flex");
            $(".modal-info").css('display', 'flex');
            $(".modal-info").css('max-width', width + "px");
            $("#info-input").addClass("text-center");
            $("#info-input").removeClass("text-start");
            $(".overlay-modal-info").toggle();
        });
    }
    $(`#btn-info-4`).on("click", function () {
        $("#info-input").addClass("text-start");
        $("#info-input").removeClass("text-center");

    });
    for (let i = 1; i <= 10; i++) {
        $(`#btn-info-q${i}`).on("click", function () {
            let text = $(this).next().html();
            let width = $(this).next().attr("data-width");
            $("#info-input").html();
            $("#info-input").html(text);
            $(".modal").css("display","flex");
            $(".modal-info").css('display', 'flex');
            $(".modal-info").css('max-width', width + "px");
            $("#info-input").addClass("text-center");
            $("#info-input").removeClass("text-start");
            $(".overlay-modal").toggle();
        });
    }
    //Quiz
    $(`.quiz-design-link`).on("click", function () {
        if ($("#quiz-"+(step)+" .info-text").html()) {
            let text = $("#quiz-"+(step)+" .info-text").html();
            $("#info-input").html();
            $("#info-input").html(text);
            $(".modal").css("display","flex");
            $(".modal-info").css('display', 'flex');
            $("#info-input").addClass("text-center");
            $("#info-input").removeClass("text-start");
            let width = $("#quiz-"+(step)+" .info-text").attr("data-width");
            $(".modal-info").css('max-width', width + "px");
            $(".overlay-modal").css("display", "block");
        };
    });

    $(".size-block #sideA, .size-block #sideB, .size-block #sideC").on("change", function () {
        if (
            $(".size-block #sideA").val() !== '' &&
            $(".size-block #sideB").val() !== '' &&
            $(".size-block #sideC").val() !== ''
            ) {
                $(".quiz-next").removeClass("quiz-next-desable");
                $(".quiz-back").removeClass("quiz-next-desable");
        }else {
            $(".quiz-next").addClass("quiz-next-desable");
            $(".quiz-back").addClass("quiz-next-desable");
        }
        if ($("#quiz-10 .switch input").prop('checked')) {
            $("#quiz-10 .switch input").prop('checked', false);
        }
    });

    $("#quiz-10 .switch input").on("change", function () {
        if ($("#quiz-10 .switch input").prop('checked')) {
                $(".quiz-next").removeClass("quiz-next-desable");
                $(".quiz-back").removeClass("quiz-next-desable");
                $(".size-block #sideA").val('');
                $(".size-block #sideB").val('');
                $(".size-block #sideC").val('');
        }else {
            $(".quiz-next").addClass("quiz-next-desable");
            $(".quiz-back").addClass("quiz-next-desable");
        }
    });

    $(".quiz-next").on("click",function (){
        if ($(".quiz-next").parent().find(".quiz-next-desable").length !== 0) {
            return;
        }

        $("#quiz-"+step).hide();
        $("#quiz-"+(step+1)).css('display', 'flex');
        $(".progress-bar").css("--myVar",((step == 10 ? 94 : (step)*10) +"%"));
        $(".progress-bar").find("span").text("Расчет пройден на " + (step == 10 ? 99 : ((step)*10)) +"%");

        if ((step === 1) || (step === 2)){
            $(".quiz-back").show();
            $(".quiz-design-link").show();
        }
        if(step == 4){
            $(".quiz-design-link").hide();
        }
        if(step == 8 && $(document).width() < 768 || step == 10 && $(document).width() < 768){
            $(".btn-quiz").hide();
        }else {
            $(".btn-quiz").show();
        }
        if(step == 9){
            if(!$("#quiz-10 .switch input").prop('checked') &&
            !(
                $(".size-block #sideA").val() !== '' &&
                $(".size-block #sideB").val() !== '' &&
                $(".size-block #sideC").val() !== ''
            )) {
                $(".quiz-next").addClass("quiz-next-desable");
                $(".quiz-back").addClass("quiz-next-desable");
            }
        }
        if(step == 8){
            if($("#quiz-9").find(".active").length == 0) {
                $(".quiz-next").addClass("quiz-next-desable");
                $(".quiz-back").addClass("quiz-next-desable");
            }
        }
        if(step == 10){
            if($("#quiz-11").find(".active").length == 0) {
                $(".quiz-next").addClass("quiz-next-desable");
                $(".quiz-back").addClass("quiz-next-desable");
            }
        }
        if(step == 11){
            $(".quiz-next").hide();
            $(".quiz-back").hide();
            $(".progress-bar").css("--myVar",(90)+"%");
            $(".progress-bar").find("span").text("Расчет пройден на 100%");
            $(".Quiz .progress-bar").hide();
        }
        step++;
    });
    $(".quiz-next-section").on("click",function (){
        if ($(".quiz-next-section").parent().find(".quiz-next-desable").length !== 0) {
            return;
        }
        $(".modal").toggle("flex");
        $(".Quiz").toggle();
        $(".overlay").toggle();
        if($(".Quiz").data("open") == "close") {
            $(".Quiz").attr("data-open","open");
            $("body").css("overflow","hidden");
        }else{
            $(".Quiz").attr("data-open","close");
            $("body").css("overflow","none");
        }

        if (step == 1) {
            $("#quiz-1").hide();
            $("#quiz-2").css('display', 'flex');
            step++;
        }else {
            $("#quiz-2").hide();
            $("#quiz-"+(step)).css('display', 'flex');
        }

        $(".modal-info").hide();
        

        $(".progress-bar").css("--myVar",((step - 1)*10)+"%");
        $(".progress-bar").find("span").text("Расчет пройден на "+ ((step - 1)*10) +"%");

        if ((step === 1) || (step === 2)){
            $(".quiz-back").show();
            $(".quiz-design-link").show();
        }
        if(step == 6){
            $(".quiz-design-link").hide();
        }
        if(step == 12){
            $(".quiz-next").hide();
            $(".progress-bar").css("--myVar",(90)+"%");
            $(".progress-bar").find("span").text("Расчет пройден на 100%");
        }
    });

    $(".quiz-next-modal").on("click",function (){
        if ($("#quiz-next-modal").parent().find(".quiz-next-desable").length !== 0) {
            return;
        }

        $(`section.modal`).hide();
        $(".modal-1").hide();
        $(".overlay").css('display', 'none');
        $(".menu-modal").css('display', 'none');
        $(".menu-modal>div.active").removeClass("active");

        $(".modal").toggle("flex");
        $(".Quiz").toggle();
        $(".overlay").toggle();
        if($(".Quiz").data("open") == "close") {
            $(".Quiz").attr("data-open","open");
            $("body").css("overflow","hidden");
        }else{
            $(".Quiz").attr("data-open","close");
            $("body").css("overflow","none");
        }

        if (step == 1) {
            $("#quiz-1").hide();
            $("#quiz-2").css('display', 'flex');
            step++;
        }else {
            $("#quiz-2").hide();
            $("#quiz-"+(step)).css('display', 'flex');
        }

        $(".modal-info").hide();
        

        $(".progress-bar").css("--myVar",((step)*10)+"%");
        $(".progress-bar").find("span").text("Расчет пройден на "+ ((step)*10) +"%");

        if ((step === 1) || (step === 2)){
            $(".quiz-back").show();
            $(".quiz-design-link").show();
        }
        if(step == 6){
            $(".quiz-design-link").hide();
        }
        if(step == 12){
            $(".quiz-next").hide();
            $(".progress-bar").css("--myVar",(100 - 5)+"%");
            $(".progress-bar").find("span").text("Расчет пройден на 100%");
        }
    });

    $(".quiz-back").on("click",function (){
        if ($(".quiz-back").parent().find(".quiz-next-desable").length !== 0) {
            return;
        }

        if (step == 1){
            $(".Quiz").hide();
            $(".modal").hide();
       		$("#quiz-"+(step)).css('display', 'none');
            $(".Quiz").attr("data-open","close")
            $("body").css("overflow","scroll");
            $(".overlay").css('display', 'none');
            return
        }

        $(".modal-info").hide();
        $("#quiz-"+step).hide();
        $("#quiz-"+(step-1)).css('display', 'flex');
        $(".progress-bar").css("--myVar",((step-2)*10)+"%");
        $(".progress-bar").find("span").text("Расчет пройден на "+ ( step > 11 ? 99 : ((step-2)*10) )+"%");

        if(step == 2){
            $(".quiz-back").hide();
            $(".quiz-design-link").hide();
        }
        if(step == 7){
            $(".quiz-design-link").show();
        }
        if(step == 10 && $(document).width() < 768){
            $(".btn-quiz").hide();
        }else {
            $(".btn-quiz").show();
        }
        if(step == 12){
            $(".quiz-next").show();
        }

        step--;

    })

	 $(".count-project-btn").on("click",function (){ 
		let name = $(this).parent().parent().parent().parent().attr("data-name");
		$(".modal-mod-1").css("display","flex");
        $(".overlay").toggle();
        $(".modal").css("display","flex");
        $(".modal-mod-1 .title-mod").html(`Кухня ${catalog[name].title}`);
        for (item of catalog[name].src) {
            $(".stage-slider-mod-1").append(createSlider(item));
        }
        $(".stage-slider-mod-1").slick({
			slidesToShow: 1,
			slidesToScroll: 1,
			adaptiveHeight: true,
			autoplay: true,
			autoplaySpeed: 4000,
			prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: -10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
			nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: -10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>'
	 	});
	});

    const createPriceTable = (element) => ($(`
        <li class="row">
            <div class="col-auto fw-700">${element[0]}</div>
            <div class="col text-end kitchen-size fw-700">${element[1]}</div>
        </li>`
    ));

	$(".catalog-black-btn").on("click",function (){ 
		let name = $(this).parent().parent().parent().parent().attr("data-name");
        let type = $(`.${name}`).find('.active').attr('data-type');
		$(".modal-mod-2").css("display","flex");
        $(".overlay").toggle();
        $(".modal").css("display","flex");
        $(".modal-mod-2 .title-mod").html(`Кухня ${catalog[name].title}`);
        $(".modal-mod-2 .table-price").html(catalog[name].price[type].price);
        for (item of catalog[name].src) {
            $(".stage-slider-mod-2").append(createSlider(item));
        }
        for (item of catalog[name].price[type].equipment) {
            $('.modal-mod-2 .price-table ul').append(createPriceTable(item));
        }
        $(".stage-slider-mod-2").slick({
			slidesToShow: 1,
			slidesToScroll: 1,
			adaptiveHeight: true,
			autoplay: true,
			autoplaySpeed: 4000,
			prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: -10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
			nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: -10px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>'
	 	});
	});

    const createSlider = (src) => ($(`<div class="stage-slide"><img src=${src}></img></div>`));

	$(".order-project-btn").on("click",function (){ 
        let name = $(this).parent().parent().parent().parent().attr("data-name");
		$(".modal-mod-3").css("display","flex");
        $(".overlay").toggle();
        $(".modal").css("display","flex");
        $(".modal-mod-3 .title-mod").html(`Кухня ${catalog[name].title}`);
        for (item of catalog[name].src) {
            $(".stage-slider-mod-3").append(createSlider(item));
        }
        $(".stage-slider-mod-3").slick({
			slidesToShow: 1,
			slidesToScroll: 1,
			adaptiveHeight: true,
			autoplay: true,
			autoplaySpeed: 4000,
			prevArrow: '<button id="prev" type="button" class="btn btn-juliet" style="left: -50px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleleft.png" alt=""></button>',
			nextArrow: '<button id="next" type="button" class="btn btn-juliet" style="right: -50px;top: 50%;position: absolute;z-index: 5;"><img src="./assets/img/arrowcircleright.png" alt=""></button>'
	 	});
    });

    $(".quiz-design-link").on("click",function (){
       let text = $("#quiz-"+step).find(".info-text").html();
        $("#info-input").html();
        $("#info-input").html(text);
        $(".modal-info").css('display', 'flex');
    });

    $(".tech .control").on("click",function (){
        $(this).parent().find("input[type='radio']:checked").prop('checked', false);
        $(this).find("input[type='radio']").prop('checked', true);
        let DS = $("#DS input[type='radio']:checked").parent().index()+1;
        if(DS != 1){
            
            $("#MW input[type='radio']:checked").prop('checked', false);
            $("#MW:last-child input").prop('checked', true);
        } else{
            $("#MW").show();
        }
        let MW = $("#MW input[type='radio']:checked").parent().index()+1;
        let RF = $("#RF input[type='radio']:checked").parent().index()+1;
        let VT = $("#VT input[type='radio']:checked").parent().index()+1;
        $("#quiz-2-img img").attr("src","./assets/quiz/"+DS+MW+RF+VT+".png");
    });

    $(".input-number").on("keyup",function (e){
        // check input using regex
        var regex = RegExp(/^\d+$/);
        const test_result = regex.test(e.target.value);

        if(test_result || e.target.value.length == 0){
            e.target.defaultValue = e.target.value;
        }else{
            e.target.value = e.target.defaultValue;
        }
    });

    $(".name-input").on("keyup",function (e){
        // check input using regex
        var regex = RegExp(/^[а-яА-я]+$/);
        const test_result = regex.test(e.target.value);

        if(test_result || e.target.value.length == 0){
            e.target.defaultValue = e.target.value;
        }else{
            e.target.value = e.target.defaultValue;
        }
    });

    $("form .mf-button").addClass("button-desable");
    $("form input").on("keyup",function (){
        if (
            ($(this).parent().find(".name-input") ? $(this).parent().find(".name-input").val() : true)  !== '' 
            && 
            $(this).parent().find(".tel-input").val().length  == 17
            ) {
                $(this).parent().find('.mf-button').removeClass('button-desable');
            }else {
                $(this).parent().find('.mf-button').addClass('button-desable')
            }
    });

    //AJAX

	const url = 'http://mfslon.bitrix24.ru';
    $(".visit-btn").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Запись в салон',
            Имя: $(this).parent().find("#ModalName").val(),
            Телефон: $(this).parent().find("#ModalTel").val(),
			// date: $(this).parent.find("#ModalDate").val(),
        })
		timeoutOpenModalStock.clear();
    });

    $(".call-me").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Перезвоните мне',
            Телефон: $(this).parent().find("#ModalTel").val(),
			// date: $(this).parent.find("#ModalDate").val(),
        })
		timeoutOpenModalStock.clear();
    });    

	$(".3d-project-online").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Запись в салон',
            Имя: $(this).parent().find("#ModalName").val(),
            Телефон: $(this).parent().find("#ModalTel").val(),
			// date: $(this).parent?.find("#ModalDate")?.val() ,
        })
		timeoutOpenModalStock.clear();
    });

	$(".order-measurement-second-step").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Заказать замер',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".order-measurement-application").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Заказать замер',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
			file: $(this).parent().find("#DesignFile2").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".order-measurement").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Заказать замер',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".get-present").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Получить подарок',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".advantage-offer-installment").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Воспользоваться предложением рассрочки',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".advantage-offer-kitchen").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Воспользоваться предложением установки кухни',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".get-cashback").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Получить кэшбэк',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".get-discount").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Получить cкидку 45%',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".get-small-discount").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Получить cкидку 40%',
            Имя: $(this).parent().find("#DesignName").val(),
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".make-appointment").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Записаться на встречу к дизайнеру',
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".calculate-price-mod-3").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Рассчитать стоимость - заказать проект',
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".calculate-price-mod-1").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Рассчитать стоимость - рассчитать по вашим размерам',
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".calculate-price-mod-2").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Рассчитать стоимость - посмотреть характеристики',
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".get-best-price").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Получить лучшую цену на кухню',
            Телефон: $(this).parent().find("#DesignTel").val(),
            Имя: $(this).parent().find("#DesignName").val(),
			// file: $(this).parent().find("#DesignFile").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".order-other-furniture").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Подобрать технику для кухни',
            Телефон: $(this).parent().find("#ModalTel").val(),
            Имя: $(this).parent().find("#ModalName").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".get-consultation").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Получить консультацию',
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".make-appointment-step-3").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Записаться на встречу',
            Телефон: $(this).parent().find("#DesignTel").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".book-price-standard").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Забронировать стоимость стандарт',
            Телефон: $(this).parent().find("#ExampleTel").val(),
            Имя: $(this).parent().find("#ExampleName").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".order-measurement-froze").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Заказать замер',
            Телефон: $(this).parent().find("#ExampleTel").val(),
            Имя: $(this).parent().find("#ExampleName").val(),
        })
		timeoutOpenModalStock.clear();
    });

	$(".quiz-btn").on("click", function () {
        if ($(this).parent().find('.button-desable').length !== 0) {
            return
        }
        $.post(url, {
            city: 'Орел',
            project_name: 'MFSlon',
            form_subject: 'Получить все бонусы',
            Телефон: $(this).parent().find("#QuizTel").val(),
            Имя: $(this).parent().find("#QuizName").val(),
        })
		timeoutOpenModalStock.clear();
		
		setTimeout(function(){
			$(location).attr('href','thank-page.html');
		  }, 1000 );
    });

	let quizPrice = {};

	$(".quiz-next-section").on("click", function () {
        if ($(".quiz-next-section").parent().find(".quiz-next-desable").length !== 0) {
            return;
        }
		quizPrice.kitchenShape = $(this).parent().parent().parent().find(".active").text();
    });

    $("#quiz-next-modal").on("click", function () {
        if ($("#quiz-next-modal").parent().find(".quiz-next-desable").length !== 0) {
            return;
        }
		quizPrice.kitchenShape = $(this).parent().parent().parent().find(".active").text();
    });

	$(".quiz-next").on("click", function () {
        if ($(".quiz-next").parent().find(".quiz-next-desable").length !== 0) {
            return;
        }
		if (step === 2) {
			quizPrice.kitchenShape = $(this).parent().parent().parent().find(".active").first().text();
			
		};
		if (step === 3) {
			let child = $("#quiz-2").children();
			for (tech of child) {
				let children = $(tech).find(".control-group").children();
				for (child of children) {
					let checked = $(child).find('input').prop('checked');
					if (checked) {
						let property = $(child).find('input').parent().parent().parent().find('span:first-child').attr('data');
						quizPrice[property] = $(child).find("input").next().text();
					};
				}
			};
			return;
		};
		if (step === 4) {
			quizPrice.kitchenUnitLayout = $("#quiz-3").find(".active").text();
			return;
		};
		if (step === 5) {
			quizPrice.typeUpperCabinets = $("#quiz-4").find(".active").text();
			return;
		};
		if (step === 6) {
			quizPrice.fittingsBaseCabinets = $("#quiz-5").find(".active").text();
			return;
		};
		if (step === 7) {
			quizPrice.facadeMaterial = $("#quiz-6").find(".active").text();
			let children = $("#quiz-6").find(".control-group").children();
			for (child of children) {
				let checked = $(child).find('input').prop('checked');
				if (checked) {
					quizPrice.facadeForm = $(child).find("input").next().text();
				};
			}
			return;
		};
		if (step === 8) {
			quizPrice.countertopMaterial = $("#quiz-7").find(".active").text();
			return;
		};
		if (step === 9) {
			quizPrice.skirting = $("#quiz-8").find(".active").text();
			return;
		};
		if (step === 10) {
			quizPrice.stage = $("#quiz-9").find(".active").text();
			return;
		};
		if (step === 11) {
			let checked = $("#quiz-10").find(".switch").children().find('input').prop('checked');
			if (!checked) {
				quizPrice.kitchenDimensions = 'Без размеров';
				return;
			};
			quizPrice.kitchenDimensions_sideA = $("#quiz-10").find(".sideA").val();
			quizPrice.kitchenDimensions_sideB = $("#quiz-10").find(".sideB").val();
			quizPrice.kitchenDimensions_sideC = $("#quiz-10").find(".sideC").val();
			return;
		};
		
		if (step === 12) {
            $(".quiz-next").css("display", "none");
		    $(".quiz-back").css("display", "none");
			quizPrice.budget = $("#quiz-11").find(".active").text();
			return;
		};
		if (step === 13) {
			let children = $("#quiz-12").find(".switch");
			for (child of children) {
				let checked = $(child).find('input').prop('checked');
				if (checked) {
					quizPrice.bonus = $(child).find("input").parent().next().text();
					continue;
				};
			};
			if (quizPrice.bonus !== undefined) {
				quizPrice.bonus = 'Без бонуса';
			};
			$.post(url, {
				city: 'Орел',
				project_name: 'MFSlon',
				form_subject: 'Расчет кухни в 3х вариантах',
				Телефон: $(this).parent().find("#QuizTel").val(),
				Имя: $(this).parent().find("#QuizName").val(),
				// propertyKitchen: quizPrice,
			});
			timeoutOpenModalStock.clear();

			return;
		};
	});

    $(function () {
        $('[data-phone-pattern]').on('input blur focus', (e) => {
            var el = e.target,
                clearVal = $(el).data('phoneClear'),
                pattern = $(el).data('phonePattern'),
                matrix_def = "+7(___) ___-__-__",
                matrix = pattern ? pattern : matrix_def,
                i = 0,
                def = matrix.replace(/\D/g, ""),
                val = $(el).val().replace(/\D/g, "");
            if (clearVal !== 'false' && e.type === 'blur') {
                if (val.length < matrix.match(/([\_\d])/g).length) {
                    $(el).val('');
                    return;
                }
            }
            if (def.length >= val.length) val = def;
            $(el).val(matrix.replace(/./g, function (a) {
                return /[_\d]/.test(a) && i < val.length ? val.charAt(i++) : i >= val.length ? "" : a;
            }));
        });
    });

    let resizeObserver = new ResizeObserver(() => {

        const height1 = $(".q7-1").height();
        const height2 = $(".q7-2").height();

        if (!height1 && !height2) return;

        if (height1 < height2) {
            $(".q7-1").css('height', height2);
        } else {
            $(".q7-2").css('height', height1);
        }
    });

    resizeObserver.observe($(".q7-2")[0]);
});

// designed-form section, add files

let addFileLabel1 = document.querySelector('.addFileLabel1');
let addFileLabel2 = document.querySelector('.addFileLabel2');

let addFileInput1 = document.querySelector('.addFileInput1');
let addFileInput2 = document.querySelector('.addFileInput2');

function showStatus(label, input) {
    if (input.value !== undefined) {
        label.textContent = 'Файл добавлен';
        label.style.color = '#40AC46';
    } else {
        label.textContent = 'Прикрепите файл';;
    }
}

addFileInput1.addEventListener('change', function(event) {
    event.preventDefault();
    showStatus(addFileLabel1, addFileInput1);  
});

addFileInput2.addEventListener('change', function(event) {
    event.preventDefault();
    showStatus(addFileLabel2, addFileInput2);  
});

//quiz 12 checkbox 
let switchSale = document.getElementById('switch-sale');
let switchCredit = document.getElementById('switch-credit');
let switchCash = document.getElementById('switch-cash');

function changeCheckedInput(inp1, inp2, inp3) {
    inp1.checked = false;
    inp2.checked = false;
	// inp1.removeAttribute("checked");
	// inp2.removeAttribute("checked");
    // inp3.setAttribute("checked", "checked");
}

switchSale.addEventListener('change', function(event){
    event.preventDefault();
    changeCheckedInput(switchCredit, switchCash, switchSale);
});

switchCredit.addEventListener('change', function(event){
    event.preventDefault();
    changeCheckedInput(switchSale, switchCash, switchCredit);
});

switchCash.addEventListener('change', function(event){
    event.preventDefault();
    changeCheckedInput(switchSale, switchCredit, switchCash);
});

$(".review-slider").on("beforeChange", () => appointHiddenReviewWatchFull());

const toggleHidden = (index) => {
	if (reviewWatchFullText[index].scrollHeight > reviewWatchFullText[index].offsetHeight) {
		reviewSlider.style.height = 674 + reviewWatchFullText[index].scrollHeight - reviewWatchFullText[index].offsetHeight + 'px';
		reviewWatchFullText[index].style.maxHeight = 'none';
		return;
	}
};

const appointHiddenReviewWatchFull = () => {
	reviewWatchFullText.forEach((element, index) => element.style.maxHeight = 300 + 'px')
	document.querySelector('.review-slider').style.height = 674 + "px";
};

const reviewWatchFullBtn = document.querySelectorAll('.review-full-btn');
const reviewWatchFullText = document.querySelectorAll('.review-text');
const reviewSlider = document.querySelector('.review-slider');

reviewWatchFullBtn.forEach((element, index) => element.addEventListener("click", () => toggleHidden(index)));

// let reviewBtnNext = document.querySelectorAll('.review #next');
// let reviewBtnPrev = document.querySelectorAll('.review #prev');

// setTimeout(() => {
// 	reviewBtnNext = document.querySelector('.review #next');
// 	reviewBtnPrev = document.querySelector('.review #prev');
// 	reviewBtnNext.addEventListener("click", () => appointHiddenReviewWatchFull());
// 	reviewBtnPrev.addEventListener("click", () => appointHiddenReviewWatchFull());
// }, 1000);
let inputDate1 = document.querySelector('.inputDate1');

inputDate1.addEventListener('focus', function(event){
    event.preventDefault();
    this.type='date'
});

inputDate1.addEventListener('blur', function(event){
    event.preventDefault();
    this.type='text';
});

let inputDate2 = document.querySelector('.inputDate2');

inputDate2.addEventListener('focus', function(event){
    event.preventDefault();
    this.type='date'
});

inputDate2.addEventListener('blur', function(event){
    event.preventDefault();
    this.type='text';
});
